# [문제1]
# 지갑에 아래와 같이 돈을 가지고 있다. 총금액 얼마인가?
# 각각의 금액을 변수에 넣어서 연산을 수행하여 총금액을 구하라.
# 1만원 4장
# 1000원 3장
# 500원 5개
# 100원 9개
# 10원 6개

# [정답]
a = 10000 * 4
b = 1000 * 3
c = 500 * 5
d = 100 * 9
e = 10 * 6
t = a + b + c + d + e
print("총금액:", t)


#%%

# [문제2]
# 위 1번 문제의 총금액에서 
# 아래의 금액을 지출하고 남은 금액은 얼마인가?
# 15000원짜리 2개를 지출

g = 15000 * 2
l = t - g
print("지출액:", g)
print("남은돈:", l)

#%%
# [문제3]
# 한 달 급여가 400만원이다.
# 분기별 보너스는 월급여의 30%가 지급된다.
# 세금은 월급여의 3%이다.
# 보너스에 대한 세금은 없다.
# 월세후 수령액은 얼마인가?
# 연 총세금은 얼마인가?
# 세후 연수령액은 얼마인가?


