# -*- coding: utf-8 -*-

# 클래스: class
# 속성(property): 변수, 클래스에 종속된 멤버변수
# 메소드(method): 함수, 클래스에 종속된 멤버함수
# self: 객체의 식별자
# 생성자: 객체가 생성될 때 호출 됨
# 소멸자: 객체가 소멸될 때 호출 됨
#         프로그램이 종료될 때 호출 됨
# 정의: 클래스 이름은 첫문자를 대문자로 시작(관례적으로)    
"""    
class 클래스이름:
    def 함수이름(self):
        실행문        
"""  
#%%

# 빈클래스: 이름만 가지고 있는 빈 클래스
class Calc:
    pass

# 빈 함수: 이름만 가지고 있는 빈 함수
def calc():
    pass


#%%

# 함수호출
calc()

#%%
# 클래스 생성
# Calc 클래스를 인스턴스화 해서 객체를 생성하여 변수에 할당
# c1과 c2는 서로 독립적인 객체이다.
# 수행하는 기능은 동일하다.
c1 = Calc()
c2 = Calc()

print(c1 == c2) # False
print(id(c1), c1)
print(id(c2), c2)




