# 문자열 슬라이싱(slicing)
# 특정한 범위를 지정해서 추출
# 추출을 하게되면 기존의 문자열의 변화는 없다.(원본의 변화는 없다)
# 추출된 문자열은 새로운 변수에 할당
#
# 변수 = 문자열[시작번호:종료번호]
# 시작위치 : 0부터시작
# 종료위치 : 종료번호 - 1까지

s ="영일이삼사오육칠팔구십"
print(s)

#%%
s37 = s[3:7]  # 3 ~ 7-1
print(s, "s[3:7] : ", s37) # 삼사오육

#%%

s33 = s[3:3]
print(s33)  # 슬라이싱 결과 0개


#%%

s34 = s[3:4]
print(s34)  # 슬라이싱 결과 1개(시작위치)

#%%

# 전체를 슬라이싱
s10a = s[0:len(s)]
s10b = s[:]
print(s10a)
print(s10b)

#%%

# 맨 마직막 요소는 제외
s10m = s[:-1] # 영일이삼사오육칠팔구
print(s10m)

#%%

# 시작위치:생략(끝까지) 
s4x = s[4:]
print(s4x)

#%%

# 맨마지막
sl10a = s[-1]
sl10b = s[-1:]
print(sl10a, sl10b)
