"""
실수 포맷

"""
e=2.24
print("올해경제성장치 : (%f)" %e)
print("올해경제성장치 : (%d)" %e)
print("올해경제성장치 : (%.2f)" %e)
#소수점 2자리만 출력 그 이후자리는 반올림


#%%

"""
전체 자릿수 지정
정렬: 기본은 우측정렬
정렬 -1, 좌측정렬
남은 자릿수는 공백 처리
"""

pi=3.141592

print("원주율은 (%f)" %pi)
print("원주율은 (%10f)" %pi)
print("원주율은 (%10.2f)" %pi)
print("원주율은 (%-10.2f)" %pi)


#%%

n2=10
n4=1000
n5=10000


print("정수 자릿수 지정(%6d)" %n2)
print("정수 자릿수 지정(%6d)" %n4)
print("정수 자릿수 지정(%6d)" %n5)


print("정수 자릿수 지정(%-6d)" %n2)
print("정수 자릿수 지정(%-6d)" %n4)
print("정수 자릿수 지정(%-6d)" %n5)

#%%

#문자열 정렬


s="문자열 정렬"
#한글은 2칸을 차지하고 한문자로 인식됨
print("기본 (%s)" %s)
print("우측 (%10s)" %s)
print("좌측 (%-10s)" %s)




