"""문자열 인덱싱
문자열은 연속된 문자들의 집합
참조:특정한 위치의 문자를 본다
시작위치:0부터
참조방법:문자열[인덱스]
참조범위:0~n-1
참조만 할뿐 바꿀수 없음


"""

s="qwerasdfzxcv"

sl=len(s)
print(sl, ":", s)#12개의 배열

print(s[0], s[11])#변수s의 1번째 배열과 12번째 배열을 불러옴
print(s[0], s[sl-11])#"-"를 이용시 뒷배열 부터 참조함

#%%

#인덱스를 이용하여 값을 바꿀수는 없음
#문자열 전체 변경은 가능
print("바꾸기전:", s)
s="poulkjhmnvb"
print("바뀐후", s)

#%%
"""한글도 영문과 동일하게 배열 사용가능
    영어는 바이트 단위이나 한글은 문자단위
    """
    
    
k="안녕하세요"
    
print(len(k))

#%%


"""(-)를 이용하여 문자열의 처음인덱스 참조가능
len() 의 값을 사용함
"""
e="asdfadfa"
print(f"문자열의 처음: '{e[0]}'")
print(f"문자열의 처음: '{e[len(e)*-1]}'") #-10=10*-1
print(f"문자열의 처음: '{e[-len(e)]}'")#-10 = -len(s)
