# 문자열(string)
# 자료형 : str

#%%

# 싱글라인 문자열 선언
s1 = "문자열입니다."  # 큰따옴표
s2 = '문자열입니다.'  # 작은따옴표


#%%

sms = "안녕하세요?\n'파이선'의 세계에 오신 것을\n환영합니다."
print(sms)

#%%
# 멀티라인 문자열 선언 : 큰따옴표 또는 작은따옴표
# 큰따옴표 3개로 시작하고 3개로 종료하고
# 큰따옴표 사이에 문자열을 지정
sml = """안녕하세요?
'파이선'의 세계에 오신 것을
환영합니다."""
print(sml)

#%%

sml2 = '''안녕하세요?
'파이선'의 세계에 오신 것을
환영합니다.'''
print(sml2)

#%%

# 문자열 연결 : \
# 문자열을 여러 라인으로 지정하고 
# 출력은 하나의 라인으로 처리
sms2 = "안녕하세요? \
'파이선'의 세계에 오신 것을 \
환영합니다."
print(sms2)

#%%

sms3 = ""  # 빈문자열
sms3 += "안녕하세요? "
sms3 += "'파이선'의 세계에 오신 것을 "
sms3 += "환영합니다."
print(sms3)

#%%

# defined : 정의 또는 선언됨
# NameError: name 'sms4' is not defined
# sms4 = sms4 + "..."

sms4 = "안녕하세요? "
sms4 += "'파이선'의 세계에 오신 것을 "
sms4 += "환영합니다."
print(sms4)

#%%


