# 문자열 인덱싱
# 문자열은 연속된 문자들의 집합
# 참조: 특정한 위치의 문자를 본다(읽음)
# 시작위치 : 0부터 시작
# 참조방법 : 문자열[인덱스]
# 참조범위 : 0 ~ n-1, n=len(문자열)
# 제약사항 : 참조는 할 수 있지만 바꿀 수 없다. (read-only)

#%%

# 한글도 영문과 동일하게 논리적인 단위로 참조
# 바이트 단위가 아니라 글자 단위로 처리

s ="일이삼사오육칠팔구십"
sl = len(s)  # 문자열의 길이(length)를 리턴
print(sl, ':', s)

#%%
# 참조 : 0부터 9(10-1)
print(s[0], s[1], '...', s[sl-2], s[sl-1])

#%%

# 참조방식 : minus(-)로 뒤에서부터 참조 가능
print(s[0], s[1], '...', s[-2], s[-1])
print(s[-10], s[-9], '...', s[-2], s[-1])

#%%

# IndexError: string index out of range
# print(s[-11])

#%%

# minus(-)로 문자열의 처음 인덱스 참조
# len()의 값을 이용하라.

print(f"문자열의 처음: '{s[0]}'")
print(f"문자열의 처음: '{s[len(s)*-1]}'") # -10 = 10 * -1
print(f"문자열의 처음: '{s[-len(s)]}'")   # -10 = -len(s)





