# -*- coding: utf-8 -*-

# 함수 
# 기본값(default value)

# 함수정의
# z : 기본값으로 5를 지정
def move(x, y, z=5):
    print(f"move:x={x}, y={y}, z={z}")
    
#%%

# 호출: z에 해당하는 인자는 생략
move(10,20)      # x:10, y:20, z:5
move(x=77,y=88)  # x:77, y:88, z:5
move(10,20,30)   # x:10, y:20, z:30
move(10,20,z=30) # x:10, y:20, z:30
move(x=10,y=20,z=30) # x:10, y:20, z:30

#%%
# 오류인 경우
# move(x=10,20,z=30)
# move(x=10,20,30)
# move(10,y=20,30)

#%%

# 함수를 호출할 때 인자에 함수의 파라미터를 지정할 수 있다.
# 파라미터를 일부만 지정할 경우 뒤에서부터 지정을 해야 한다.

move(10,20,z=30)
move(10,y=20,z=30)
move(x=10,y=20,z=30)

